teapotlaboratories/pico-e32/boards/makerfabs-st7701-4in/sdkconfig.defaults
# Board: Makerfabs "ESP32-S3 Parallel TFT with Touch 4.0"" (ST7701), 480x480 RGB.
# Module ESP32-S3-WROOM-1-N16R8 = 16 MB flash + 8 MB OCTAL PSRAM, 240 MHz.
# Later target (behind Gate #5, the RGB drift soak test). See the development plan.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
